{
  "side": "RIGHT",
  "y_position": 4,
  "color": 0,
  "content": {
    "pages": [
      {
        "title": "1st Hoof '12",
        "level": 1,
        "elements": [
          "A new month, a new chapter. Little Luna was getting bored of sitting in the tower all day (and who's to blame her? We've been on this assignment for over two months at this point).",
          "So as a little treat, we've decided to go on a little trip to the Grand Marepid Falls to visit my friend, Commander Hurricane."
        ]
      },
      {
        "title": "",
        "level": 1,
        "elements": [
          "The Commander has also very graciously allowed me access to her library to continue my studies. I'm excited to see what combining unicorn and pegasus magics might bring."
        ]
      },
      {
        "title": "",
        "level": 0,
        "elements": []
      },
      {
        "title": "Ch.3 Air Magic",
        "level": 1,
        "elements": [
          { "x": 15, "y": 0, "width": 128, "height": 128, "texture": "unicopia:textures/gui/container/pages/air_magic.png" }
        ]
      },
      {
        "title": "Air Magic I",
        "level": 3,
        "elements": [
          "Pegasus Magic",
          "Air magic is to pegasi like fire is to unicorns. They're both equally hard to control but where fire is primarily focused around force, destruction, or protection, air is all about flexibility and free motion.",
          "Command Hurricane has very kindly given me some tips on how to identify this trait in everyday objects.",
          { "x": 125, "y": -20, "width": 32, "height": 32, "texture": "unicopia:textures/gui/trait/air.png" },
          { "x": 125, "y": -20, "width": 16, "height": 16, "texture": "unicopia:textures/gui/trait/chaos.png" }
        ]
      },
      {
        "title": "",
        "level": 3,
        "elements": [
          "Anything relating to flight, or that originated from creatures that fly, or that comes from up above can be considered a source of the air trait.",
          "Eg. Feathers",
          "At the princess' behest",
          "- Starswirl the Bearded"
        ]
      },
      {
        "title": "Catapult",
        "level": 4,
        "elements": [
          "This is a straightforward application of a unicorn's telekineses. The catapult gem allows a caster to grab any block or creature and fling them into the air.",
          "Use it again on something already thrown to push it away from you.",
          { "x": 125, "y": -20, "width": 32, "height": 32, "texture": "unicopia:textures/gui/trait/air.png" },
          { "x": 125, "y": -20, "width": 16, "height": 16, "texture": "unicopia:textures/gui/trait/chaos.png" }
        ]
      },
      {
        "title": "",
        "level": 4,
        "elements": [
          { "recipe": "unicopia:spells/catapult" },
          "Requires:",
          "- 1 flame gem\n- At least 9x focus trait\n- At least 9x air trait",
          "One can add apply force by the strength trait"
        ]
      },
      {
        "title": "8th Hoof '12",
        "level": 4,
        "elements": [
          "I thought I would take a short moment to write down an entry to record my findings whilst Luna and The Commander are out.",
          "Pegasi magic really is a fascinating beast. It's not like our magic, which is more of a study, with rigid rules and practices."
        ]
      },
      {
        "title": "Pegasi",
        "level": 5,
        "elements": [
          "Pegasus magic is more about feeling. It's an art form. They don't think about what they want to do, it just happens, but it all still follows the same principle."
        ]
      },
      {
        "title": "Pegasi II",
        "level": 6,
        "elements": [
          "Take for example their cloud homes. There are no spells I can read that would let me do this, but if you feel, not with your hooves or your horn, but properly, with your mind, your heart, you will find magic buzzing all throughout.",
          "Clouds are teeming with the air and water trait, but also others, like power, strength, life, earth. All traits of the material the clouds are mimicking."
        ]
      },
      {
        "title": "Pegasi III",
        "level": 7,
        "elements": [
          "I wish I could study this further, but I'm afraid to interfere in this magic I don't yet fully understand.",
          "Commander Hurricane may never forgive me if I destroy her home the first time I'm here.",
          "At the princess' behest",
          "- Starswirl the Bearded"
        ]
      },
      {
        "title": "Feather Falling",
        "level": 5,
        "elements": [
          "Expanding on the defensive capabilities of the protection gem, I've attempted to extend its advantages to party members.",
          "This one is unusual because of its complexity, but in theory it should allow one to slow their own and friends' descent.",
          { "x": 125, "y": -20, "width": 32, "height": 32, "texture": "unicopia:textures/gui/trait/air.png" },
          { "x": 125, "y": -20, "width": 16, "height": 16, "texture": "unicopia:textures/gui/trait/chaos.png" }
        ]
      },
      {
        "title": "",
        "level": 5,
        "elements": [
          { "recipe": "unicopia:spells/feather_fall" },
          "Requires:",
          "- 1 protection gem\n- At least 20x knowlege trait\n- At least 10x life trait\n- At least 10x generosity trait\n- At least 4x chaos trait"
        ]
      }
    ]
  }
}